app/controllers/users_controller.rb

    def create
        user = User.new(user_params)
        if user.valid?
            user.save
---
INSERT INTO "users" ("first_name", "last_name", "username", "email", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["first_name", "test1"], ["last_name", "test1"], ["username", "test1"], ["email", "test1"], ["created_at", "2020-08-19 14:44:12.656891"], ["updated_at", "2020-08-19 14:44:12.656891"]]